Revit 2027 API
WallSweep.GetWallSweepInfo Method
 Gets the information of the wall sweep or reveal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WallSweepInfo GetWallSweepInfo()
Public Function GetWallSweepInfo As WallSweepInfo
public:
WallSweepInfo^ GetWallSweepInfo()
member GetWallSweepInfo : unit -> WallSweepInfo
Return Value
WallSweepInfo
 The information that describes the wall sweep or reveal.
See Also
Reference
WallSweep Class
Autodesk.Revit.DB Namespace